{
  "id": "argumentative-essay-v1",
  "title": "Argumentative Essay Rubric",
  "criteria": [
    {
      "id": "thesis",
      "name": "Thesis Statement",
      "weight": 0.25,
      "levels": [
        {
          "name": "Excellent",
          "description": "Clear, arguable thesis that directly addresses the prompt and provides a roadmap for the essay.",
          "points": 4
        },
        {
          "name": "Good",
          "description": "Clear thesis that addresses the prompt, though it may lack some specificity or roadmap elements.",
          "points": 3
        },
        {
          "name": "Fair",
          "description": "Thesis is present but unclear, weak, or only partially addresses the prompt.",
          "points": 2
        },
        {
          "name": "Poor",
          "description": "Thesis is missing, unclear, or does not address the prompt at all.",
          "points": 1
        }
      ]
    },
    {
      "id": "evidence",
      "name": "Evidence and Support",
      "weight": 0.30,
      "levels": [
        {
          "name": "Excellent",
          "description": "Strong, relevant evidence from credible sources that directly supports the argument. Evidence is well-integrated and properly cited.",
          "points": 4
        },
        {
          "name": "Good",
          "description": "Good evidence that supports the argument, though some sources may be less credible or evidence may be less well-integrated.",
          "points": 3
        },
        {
          "name": "Fair",
          "description": "Some evidence provided, but it may be weak, irrelevant, or poorly integrated into the argument.",
          "points": 2
        },
        {
          "name": "Poor",
          "description": "Little to no evidence provided, or evidence is irrelevant, weak, or improperly used.",
          "points": 1
        }
      ]
    },
    {
      "id": "analysis",
      "name": "Analysis and Reasoning",
      "weight": 0.25,
      "levels": [
        {
          "name": "Excellent",
          "description": "Sophisticated analysis that clearly explains how evidence supports the argument. Shows deep understanding and critical thinking.",
          "points": 4
        },
        {
          "name": "Good",
          "description": "Good analysis that explains the connection between evidence and argument, though it may lack some depth.",
          "points": 3
        },
        {
          "name": "Fair",
          "description": "Basic analysis present, but it may be superficial or fail to fully explain the connection between evidence and argument.",
          "points": 2
        },
        {
          "name": "Poor",
          "description": "Little to no analysis provided, or analysis is illogical, superficial, or fails to connect evidence to argument.",
          "points": 1
        }
      ]
    },
    {
      "id": "organization",
      "name": "Organization and Structure",
      "weight": 0.10,
      "levels": [
        {
          "name": "Excellent",
          "description": "Clear, logical organization with smooth transitions between paragraphs. Essay flows naturally from introduction to conclusion.",
          "points": 4
        },
        {
          "name": "Good",
          "description": "Generally well-organized with mostly clear transitions, though some areas may be less smooth.",
          "points": 3
        },
        {
          "name": "Fair",
          "description": "Basic organization present, but transitions may be weak or the structure may be somewhat unclear.",
          "points": 2
        },
        {
          "name": "Poor",
          "description": "Poor organization with weak or missing transitions, or structure that is confusing or illogical.",
          "points": 1
        }
      ]
    },
    {
      "id": "language",
      "name": "Language and Style",
      "weight": 0.10,
      "levels": [
        {
          "name": "Excellent",
          "description": "Clear, precise language with varied sentence structure. Tone is appropriate and engaging. Few to no grammatical errors.",
          "points": 4
        },
        {
          "name": "Good",
          "description": "Generally clear language with some sentence variety. Tone is mostly appropriate. Minor grammatical errors that don't impede understanding.",
          "points": 3
        },
        {
          "name": "Fair",
          "description": "Language is mostly clear but may be repetitive or simplistic. Some grammatical errors that occasionally impede understanding.",
          "points": 2
        },
        {
          "name": "Poor",
          "description": "Language is unclear, repetitive, or inappropriate. Frequent grammatical errors that significantly impede understanding.",
          "points": 1
        }
      ]
    }
  ],
  "scaleNote": "This rubric uses a 4-point scale where 4 = Excellent, 3 = Good, 2 = Fair, 1 = Poor. Total possible points: 20. Letter grades: A+ (18-20), A (16-17), B+ (14-15), B (12-13), C+ (10-11), C (8-9), D (6-7), F (0-5)."
}
